## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                  |
|--------|------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.oom-errors[0]`                       |
|        | `aws_cloudwatch_log_metric_filter.socket-error[0]`                     |
|        | `aws_cloudwatch_metric_alarm.logs-1-oom-error-1-minute-warning[0]`     |
|        | `aws_cloudwatch_metric_alarm.logs-1-socket-error-1-minute-warning[0]`  |
|        | `aws_cloudwatch_metric_alarm.logs-10-oom-error-5-minute-warning[0]`    |
|        | `aws_cloudwatch_metric_alarm.logs-10-socket-error-1-minute-warning[0]` |
| update | `aws_cloudwatch_log_metric_filter.celery-error[0]`                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0] will be imported
    resource "aws_cloudwatch_log_group" "notification-canada-ca-eks-host-logs" {
        arn               = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/containerinsights/notification-canada-ca-production-eks-cluster/host"
        id                = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/host"
        kms_key_id        = null
        log_group_class   = "STANDARD"
        name              = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/host"
        name_prefix       = null
        retention_in_days = 0
        skip_destroy      = false
        tags              = {}
        tags_all          = {}
    }

  # aws_cloudwatch_log_metric_filter.celery-error[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "celery-error" {
        id             = "celery-error"
        name           = "celery-error"
      ~ pattern        = "%ERROR/.*Worker|ERROR/MainProcess%" -> "\"ERROR/\" ?Worker ?MainProcess -\"Failed to write metrics\""
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.oom-errors[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "oom-errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/host"
      + name           = "oom-errors"
      + pattern        = "%Memory cgroup out of memory%"

      + metric_transformation {
          + name      = "oom-errors"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.socket-error[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "socket-error" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application"
      + name           = "socket-error"
      + pattern        = "%Failed to write metrics to the socket due to socket%"

      + metric_transformation {
          + name      = "socket-error"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.logs-1-oom-error-1-minute-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-oom-error-1-minute-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "One oom error in 1 minute"
      + alarm_name                            = "logs-1-oom-error-1-minute-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "oom-errors"
      + namespace                             = "LogMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-1-socket-error-1-minute-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-socket-error-1-minute-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "One socket error in 1 minute"
      + alarm_name                            = "logs-1-socket-error-1-minute-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "socket-error"
      + namespace                             = "LogMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-10-oom-error-5-minute-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-10-oom-error-5-minute-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Ten oom errors in 5 minute"
      + alarm_name                            = "logs-10-oom-error-5-minute-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "oom-errors"
      + namespace                             = "LogMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-10-socket-error-1-minute-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-10-socket-error-1-minute-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Ten Socket errors in 1 minute"
      + alarm_name                            = "logs-10-socket-error-1-minute-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "socket-error"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

Plan: 1 to import, 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
